<?php
$lang = [];

$lang = [
    "settings" => __("Налаштування", "gpt-textdomain"),
    "temperature" => __("Температура:", "gpt-textdomain"),
    "temperatureText" => __("Значення температури є мірою оригінальності. За допомогою значення температури визначається, наскільки багато випадкових відповідей створюватиме модель мови. Високе значення температури дозволяє отримувати більш творчі та різноманітні відповіді, а низьке значення температури дозволяє отримувати більш точні та значущі відповіді. Налаштування цього параметру може варіюватись залежно від призначення. Наприклад, якщо ви використовуєте модель мови як генератор ігор, високе значення температури може допомогти створити більше веселих та різноманітних ігор. Однак, якщо ви використовуєте модель мови як джерело новин, низьке значення температури може забезпечити більш точні та надійні новини. Рекомендоване значення: 0.6.", "gpt-textdomain"),
    "maxTokens" => __("Максимальна кількість токенів:", "gpt-textdomain"),
    "maxTokensText" => __("Метою параметру max_tokens є вказання максимальної кількості токенів, які будуть повернені у виклику. Токен може бути визначений як розділена форма мови у системах обробки мови. Наприклад, його можна використовувати для розбиття речення на слова. Налаштування max_tokens може використовуватись для контролю довжини відповідей, що повертаються з GPT-API. Якщо в виклику не вказано настройки max_tokens, то за замовчуванням повертається 256 токенів.", "gpt-textdomain"),
    "saveSettings" => __("Зберегти налаштування", "gpt-textdomain"),
    "chatGptText" => __("Текст для запитання до чат-бота GPT:", "gpt-textdomain"),
    "testButton" => __("Показати відповідь", "gpt-textdomain"),
    "blogTitle" => __("Заголовок поста:", "gpt-textdomain"),
    "blogContent" => __("Контент поста: (буде відображатись у вихідних даних)", "gpt-textdomain"),
    "blogContentDesc" => __("Відповідь від чат-бота GPT буде відображатись тут, ви можете відредагувати її перед додаванням як пост.", "gpt-textdomain"),
    "blogCategory" => __("Категорія поста:", "gpt-textdomain"),
    "blogKeywords" => __("Ключові слова поста (відділяються комами):", "gpt-textdomain"),
    "addBlogButton" => __("Додати пост", "gpt-textdomain"),
    "selectLanguage" => __("Вибрати мову:", "gpt-textdomain"),
    "version" => __("Версія:", "gpt-textdomain")
];


